 이 칸을 셀(cell)이라고 합니다.

In [1]:
import pandas as pd

## 데이터 구조와 타입

In [3]:
odds = [1,3,5]

odds

[1, 3, 5]

In [4]:
type(odds)

list

In [5]:
#판다스에는 Series(한줄), dataframe(두 줄 이상)
pd_odds = pd.Series(odds)

pd_odds

0    1
1    3
2    5
dtype: int64

In [6]:
type(pd_odds)

pandas.core.series.Series

In [7]:
pd_odds.mean()

3.0

In [8]:
numbers = [[1,2,3],[4,5,6],[7,8,9]]

numbers

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [9]:
pd_numbers = pd.DataFrame(numbers)

pd_numbers

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [10]:
type(pd_numbers)

pandas.core.frame.DataFrame

In [11]:
data = [
    ["2020-05-22", 300, 'confirmed'],
    ["2020-05-23", 500, 'confirmed'],
    ["2020-05-24", 700, 'cancelled']
]

data

[['2020-05-22', 300, 'confirmed'],
 ['2020-05-23', 500, 'confirmed'],
 ['2020-05-24', 700, 'cancelled']]

In [164]:
cols = ['date','price','result']
idx = [3,5,7]

pd_data = pd.DataFrame(data, columns=cols, index=idx)

pd_data

         date  price  result
3  2017-01-05    800     NaN
5  2017-01-09    700     NaN
7  2017-01-10    200     NaN

## 데이터 불러오기

In [13]:
url = 'http://bit.ly/dsa-transaction'

data = pd.read_csv("transaction.csv", index_col='Name')

print(data.shape) 
# jupyter는 마지막만 띄우니까 중간중간에 print를 해줘야됨 
data.head()

(8, 3)

            date  price      state
Name
Kang  2017-01-01    500  confirmed
Kim   2017-01-03    700  confirmed
Choi  2017-01-03    900  confirmed
Park  2017-01-05    800  confirmed
Lee   2017-01-07    500   canceled

In [14]:
data.tail()

            date  price      state
Name
Park  2017-01-05    800  confirmed
Lee   2017-01-07    500   canceled
Yoon  2017-01-09    700  confirmed
Jang  2017-01-09    600   canceled
Ko    2017-01-10    200   canceled

In [15]:
data.tail(7).head(2)

            date  price      state
Name
Kim   2017-01-03    700  confirmed
Choi  2017-01-03    900  confirmed

In [16]:
data.index

Index(['Kang', 'Kim', 'Choi', 'Park', 'Lee', 'Yoon', 'Jang', 'Ko'], dtype='object', name='Name')

In [17]:
data.columns

Index(['date', 'price', 'state'], dtype='object')

In [18]:
data.columns = ['date','amount','result']

data

            date  amount     result
Name
Kang  2017-01-01     500  confirmed
Kim   2017-01-03     700  confirmed
Choi  2017-01-03     900  confirmed
Park  2017-01-05     800  confirmed
Lee   2017-01-07     500   canceled
Yoon  2017-01-09     700  confirmed
Jang  2017-01-09     600   canceled
Ko    2017-01-10     200   canceled

In [19]:
data.values

array([['2017-01-01', 500, 'confirmed'],
       ['2017-01-03', 700, 'confirmed'],
       ['2017-01-03', 900, 'confirmed'],
       ['2017-01-05', 800, 'confirmed'],
       ['2017-01-07', 500, 'canceled'],
       ['2017-01-09', 700, 'confirmed'],
       ['2017-01-09', 600, 'canceled'],
       ['2017-01-10', 200, 'canceled']], dtype=object)

## 검색하기 

열(columns) 검색

In [20]:
data['date']

Name
Kang    2017-01-01
Kim     2017-01-03
Choi    2017-01-03
Park    2017-01-05
Lee     2017-01-07
Yoon    2017-01-09
Jang    2017-01-09
Ko      2017-01-10
Name: date, dtype: object

In [21]:
data[['date','result']]
cols = ['date','result']

data[cols]

            date     result
Name
Kang  2017-01-01  confirmed
Kim   2017-01-03  confirmed
Choi  2017-01-03  confirmed
Park  2017-01-05  confirmed
Lee   2017-01-07   canceled
Yoon  2017-01-09  confirmed
Jang  2017-01-09   canceled
Ko    2017-01-10   canceled

### 행(rows) 검색

In [22]:
# loc = locate 
data.loc['Kang']

date      2017-01-01
amount           500
result     confirmed
Name: Kang, dtype: object

In [23]:
idx = ['Kang','Kim']

data.loc[idx]

            date  amount     result
Name
Kang  2017-01-01     500  confirmed
Kim   2017-01-03     700  confirmed

## 행열 동시검색

In [24]:
data.loc["Kang",'result']

'confirmed'

In [25]:
idx = ['Kang','Kim']
cols = ['date','result']

data.loc[idx,cols]

            date     result
Name
Kang  2017-01-01  confirmed
Kim   2017-01-03  confirmed

## 기본기능

In [26]:
 data['amount'].min()

200

In [27]:
data['amount'].sum()

4900

In [28]:
data['amount'].cumsum()

Name
Kang     500
Kim     1200
Choi    2100
Park    2900
Lee     3400
Yoon    4100
Jang    4700
Ko      4900
Name: amount, dtype: int64

In [29]:
data['amount'].std()

216.71244937540095

In [30]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Index: 8 entries, Kang to Ko
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    8 non-null      object
 1   amount  8 non-null      int64
 2   result  8 non-null      object
dtypes: int64(1), object(2)
memory usage: 576.0+ bytes

In [31]:
data.describe()

           amount
count    8.000000
mean   612.500000
std    216.712449
min    200.000000
25%    500.000000
50%    650.000000
75%    725.000000
max    900.000000

In [32]:
data['result'].unique()

array(['confirmed', 'canceled'], dtype=object)

In [33]:
data['result'].nunique()

2

In [34]:
data['result'].value_counts(normalize=True)

confirmed    0.625
canceled     0.375
Name: result, dtype: float64

In [35]:
data.shape[0]

8

In [36]:
len(data)

8

In [37]:
data['result'].replace('canceled','cancelled')

Name
Kang    confirmed
Kim     confirmed
Choi    confirmed
Park    confirmed
Lee     cancelled
Yoon    confirmed
Jang    cancelled
Ko      cancelled
Name: result, dtype: object

In [38]:
data['result'].str.replace('c','d')

Name
Kang    donfirmed
Kim     donfirmed
Choi    donfirmed
Park    donfirmed
Lee      dandeled
Yoon    donfirmed
Jang     dandeled
Ko       dandeled
Name: result, dtype: object

In [39]:
data['result'].str[0]

Name
Kang    c
Kim     c
Choi    c
Park    c
Lee     c
Yoon    c
Jang    c
Ko      c
Name: result, dtype: object

In [40]:
pd.to_datetime(data['date'])

Name
Kang   2017-01-01
Kim    2017-01-03
Choi   2017-01-03
Park   2017-01-05
Lee    2017-01-07
Yoon   2017-01-09
Jang   2017-01-09
Ko     2017-01-10
Name: date, dtype: datetime64[ns]

In [41]:
pd.to_datetime(data['date']).dt.day

Name
Kang     1
Kim      3
Choi     3
Park     5
Lee      7
Yoon     9
Jang     9
Ko      10
Name: date, dtype: int64

## 색인(indexing)

In [42]:
data[data['amount'] > 500]

            date  amount     result
Name
Kim   2017-01-03     700  confirmed
Choi  2017-01-03     900  confirmed
Park  2017-01-05     800  confirmed
Yoon  2017-01-09     700  confirmed
Jang  2017-01-09     600   canceled

In [43]:
data[data['result'] == 'confirmed']

            date  amount     result
Name
Kang  2017-01-01     500  confirmed
Kim   2017-01-03     700  confirmed
Choi  2017-01-03     900  confirmed
Park  2017-01-05     800  confirmed
Yoon  2017-01-09     700  confirmed

In [44]:
data[data['amount'] > 400]

            date  amount     result
Name
Kang  2017-01-01     500  confirmed
Kim   2017-01-03     700  confirmed
Choi  2017-01-03     900  confirmed
Park  2017-01-05     800  confirmed
Lee   2017-01-07     500   canceled
Yoon  2017-01-09     700  confirmed
Jang  2017-01-09     600   canceled

In [45]:
data[data['amount'] > 400]

            date  amount     result
Name
Kang  2017-01-01     500  confirmed
Kim   2017-01-03     700  confirmed
Choi  2017-01-03     900  confirmed
Park  2017-01-05     800  confirmed
Lee   2017-01-07     500   canceled
Yoon  2017-01-09     700  confirmed
Jang  2017-01-09     600   canceled

In [46]:
# data[(data['amount'] > 500) | (data['result'] =='confirmed')]
amount_over_500 = (data['amount'] > 500)
confirmed = (data['result'] =='confirmed')

cols=['date','amount']
data.loc[confirmed&amount_over_500, cols]
# 행렬동시검색시 무조건 loc

            date  amount
Name
Kim   2017-01-03     700
Choi  2017-01-03     900
Park  2017-01-05     800
Yoon  2017-01-09     700

## 행열 추가/수정

In [ ]:
열 추가/수정

In [79]:
data['card-holder'] = 'DS Card'

data

            date  amount     result card-holder
Name
Kang  2017-01-01     500  confirmed     DS Card
Kim   2017-01-03     700  confirmed     DS Card
Choi  2017-01-03     900  confirmed     DS Card
Park  2017-01-05     800  confirmed     DS Card
Lee   2017-01-07     500   canceled     DS Card
Yoon  2017-01-09     700  confirmed     DS Card
Jang  2017-01-09     600   canceled     DS Card
Ko    2017-01-10     200   canceled     DS Card

In [80]:
data['order']= [1,2,3,4,5,6,7,8]

data

            date  amount     result card-holder  order
Name
Kang  2017-01-01     500  confirmed     DS Card      1
Kim   2017-01-03     700  confirmed     DS Card      2
Choi  2017-01-03     900  confirmed     DS Card      3
Park  2017-01-05     800  confirmed     DS Card      4
Lee   2017-01-07     500   canceled     DS Card      5
Yoon  2017-01-09     700  confirmed     DS Card      6
Jang  2017-01-09     600   canceled     DS Card      7
Ko    2017-01-10     200   canceled     DS Card      8

In [83]:
data['VIP']=data['amount'] > 500
cols = ['amount','VIP']
data[cols]

      amount    VIP
Name
Kang     500  False
Kim      700   True
Choi     900   True
Park     800   True
Lee      500  False
Yoon     700   True
Jang     600   True
Ko       200  False

In [90]:
amount_over_500 = data['amount'] > 500

data.loc[amount_over_500, 'level'] = 'VIP'
data.loc[~amount_over_500, 'level'] = 'non-VIP'

cols = ['amount','level']
data[cols].head()

      amount    level
Name
Kang     500  non-VIP
Kim      700      VIP
Choi     900      VIP
Park     800      VIP
Lee      500  non-VIP

행 추가/수정

In [93]:
data.loc['Han'] = [1,2,3,4,5,6,7]
data.tail(2)

            date  amount    result card-holder  order  VIP    level
Name
Ko    2017-01-10     200  canceled     DS Card      8    0  non-VIP
Han            1       2         3           4      5    6        7

## 행열 삭제

In [97]:
data.drop(columns=['amount','result'], index=["Kang","Kim"])

            date card-holder  order  VIP    level
Name
Choi  2017-01-03     DS Card      3    1      VIP
Park  2017-01-05     DS Card      4    1      VIP
Lee   2017-01-07     DS Card      5    0  non-VIP
Yoon  2017-01-09     DS Card      6    1      VIP
Jang  2017-01-09     DS Card      7    1      VIP
Ko    2017-01-10     DS Card      8    0  non-VIP
Han            1           4      5    6        7

## Apply

In [99]:
def add(a,b):
    return a + b

In [100]:
add(1,2)

3

In [101]:
def is_vip(amount):
    return amount > 500

In [104]:
data['amount'].apply(is_vip)

Name
Kang    False
Kim      True
Choi     True
Park     True
Lee     False
Yoon     True
Jang     True
Ko      False
Han     False
Name: amount, dtype: bool

In [105]:
is_vip(data['amount'])

Name
Kang    False
Kim      True
Choi     True
Park     True
Lee     False
Yoon     True
Jang     True
Ko      False
Han     False
Name: amount, dtype: bool

In [106]:
def is_vip(row):
    return row['amount'] > 500

In [108]:
data.apply(is_vip, axis=1)

Name
Kang    False
Kim      True
Choi     True
Park     True
Lee     False
Yoon     True
Jang     True
Ko      False
Han     False
dtype: bool

## Lambda

In [5]:
import pandas as pd 
# url = 'http://bit.ly/dsa-transaction'
# data = pd.read_csv(url)
data = pd.read_csv("transaction.csv")
print(data.shape)
data.head()

(8, 4)

   Name        date  price      state
0  Kang  2017-01-01    500  confirmed
1   Kim  2017-01-03    700  confirmed
2  Choi  2017-01-03    900  confirmed
3  Park  2017-01-05    800  confirmed
4   Lee  2017-01-07    500   canceled

In [6]:
(lambda a, b: a+b)(1,3)

4

In [7]:
(lambda x: x+1)(2)

3

In [11]:
def func1(x):
    if x==3:
        return x**2
    else:
        if x==4:
            return x+100
        else:
            return x
func1(4)

104

In [12]:
(lambda x: x**2 if x==3 else x+100 if x ==4 else x)(4)

104

In [13]:
data

   Name        date  price      state
0  Kang  2017-01-01    500  confirmed
1   Kim  2017-01-03    700  confirmed
2  Choi  2017-01-03    900  confirmed
3  Park  2017-01-05    800  confirmed
4   Lee  2017-01-07    500   canceled
5  Yoon  2017-01-09    700  confirmed
6  Jang  2017-01-09    600   canceled
7    Ko  2017-01-10    200   canceled

In [14]:
data['price'].apply(lambda x: x>500)

0    False
1     True
2     True
3     True
4    False
5     True
6     True
7    False
Name: price, dtype: bool

In [15]:
data['price'].apply(lambda x: 'VIP' if x>500 else 'non-VIP')

0    non-VIP
1        VIP
2        VIP
3        VIP
4    non-VIP
5        VIP
6        VIP
7    non-VIP
Name: price, dtype: object

In [16]:
data['Name'].str[0]

0    K
1    K
2    C
3    P
4    L
5    Y
6    J
7    K
Name: Name, dtype: object

In [18]:
data['Name'].apply(lambda x: x[0] == 'K')

0     True
1     True
2    False
3    False
4    False
5    False
6    False
7     True
Name: Name, dtype: bool

In [19]:
data[data['Name'].apply(lambda x: x[0] == 'K')]

   Name        date  price      state
0  Kang  2017-01-01    500  confirmed
1   Kim  2017-01-03    700  confirmed
7    Ko  2017-01-10    200   canceled

In [20]:
data['Name'][lambda x: x.str[0]=='K']

0    Kang
1     Kim
7      Ko
Name: Name, dtype: object

In [22]:
data.loc[lambda x: x.str[0]=='K'] 
# 이건 안됨

AttributeError: 'DataFrame' object has no attribute 'str'

In [24]:
data.loc[0,'Name']
# data['Name'][0]
# loc을 쓰는게 훨씬 빠름

'Kang'

In [26]:
data['Name'][lambda x: x.str[0]=='K']

0    Kang
1     Kim
7      Ko
Name: Name, dtype: object

In [23]:
data.loc[lambda DataFrame: DataFrame['Name'].str[0]=='K']['Name']

0    Kang
1     Kim
7      Ko
Name: Name, dtype: object

In [27]:
data.loc[lambda dataframe: dataframe['Name'].str[0]=='K','Name']

0    Kang
1     Kim
7      Ko
Name: Name, dtype: object

In [32]:
# data[data['price']>500]
data['price'][lambda price: price > 500]
data.loc[lambda data : data['price'] > 500, 'Name']

1     Kim
2    Choi
3    Park
5    Yoon
6    Jang
Name: Name, dtype: object

In [33]:
data.head(10).tail(3)[lambda data: data['price'] > 500]

   Name        date  price      state
5  Yoon  2017-01-09    700  confirmed
6  Jang  2017-01-09    600   canceled

In [34]:
a = data.head(10).tail(3)
a[a['price']>500]

   Name        date  price      state
5  Yoon  2017-01-09    700  confirmed
6  Jang  2017-01-09    600   canceled

In [36]:
data.count()[lambda x: x > 7]

Name     8
date     8
price    8
state    8
dtype: int64

In [39]:
data['state'].value_counts()[lambda x: x>4]
# pandas 함수는 대부분 series나 dataframe를 리턴함

confirmed    5
Name: state, dtype: int64

## Pivot Table

In [43]:
data.pivot_table(index = 'state', values='price')
# values의 평균을 계산

                price
state
canceled   433.333333
confirmed  720.000000

In [42]:
pd.pivot_table(data=data, index = 'state', values='price')

                price
state
canceled   433.333333
confirmed  720.000000

In [45]:
data.pivot_table(index = ['state', 'date'], values='price')
#multi-index

                      price
state     date
canceled  2017-01-07    500
          2017-01-09    600
          2017-01-10    200
confirmed 2017-01-01    500
          2017-01-03    800
          2017-01-05    800
          2017-01-09    700

In [46]:
data.pivot_table(index = ['state', 'date'], values='price').loc[('canceled','2017-01-07')]

price    500
Name: (canceled, 2017-01-07), dtype: int64

In [47]:
# T = Transpose = 뒤집다 
data.pivot_table(index = ['state', 'date'], values='price').T

state   canceled                        confirmed                        \
date  2017-01-07 2017-01-09 2017-01-10 2017-01-01 2017-01-03 2017-01-05
price        500        600        200        500        800        800

state
date  2017-01-09
price        700

In [51]:
data.pivot_table(index = 'state', columns='date', values='price', fill_value=0)
# value가 없는걸 채울수 있음. 이걸 안하면 NaN으로 나옴

date,2017-01-01,2017-01-03,2017-01-05,2017-01-07,2017-01-09,2017-01-10
state,,,,,,
canceled,0,0,0,500,600,200
confirmed,500,800,800,0,700,0

In [52]:
data.pivot_table(index = 'state', columns='date', values='price').fillna(0)

date,2017-01-01,2017-01-03,2017-01-05,2017-01-07,2017-01-09,2017-01-10
state,,,,,,
canceled,0.0,0.0,0.0,500.0,600.0,200.0
confirmed,500.0,800.0,800.0,0.0,700.0,0.0

In [60]:
data.pivot_table(index='state', columns = 'date').stack()
# stack은 column을 index로 보냄. multi-index랑 같음

                      price
state     date
canceled  2017-01-07  500.0
          2017-01-09  600.0
          2017-01-10  200.0
confirmed 2017-01-01  500.0
          2017-01-03  800.0
          2017-01-05  800.0
          2017-01-09  700.0

In [62]:
data.pivot_table(index='state', columns = 'date').stack().unstack(level=1)

               price
date      2017-01-01 2017-01-03 2017-01-05 2017-01-07 2017-01-09 2017-01-10
state
canceled         NaN        NaN        NaN      500.0      600.0      200.0
confirmed      500.0      800.0      800.0        NaN      700.0        NaN

In [69]:
import numpy as np
data.pivot_table(index='state', values = 'price', aggfunc=['count','mean'])

          count        mean
          price       price
state
canceled      3  433.333333
confirmed     5  720.000000

In [70]:
data.pivot_table(index='state', values=['date','Name'], aggfunc='count')

           Name  date
state
canceled      3     3
confirmed     5     5

In [79]:
data.pivot_table(index = 'state',values='price',
                aggfunc=lambda x: x.mean()*100 - x.std())
#이 람다에선 price series가 x로 들어감

                  price
state
canceled   43125.166733
confirmed  71851.676030

In [80]:
data.pivot_table(index = 'state',values='price',
                aggfunc=lambda price: price.head(1))
# 결과물이 하나여야만함.

           price
state
canceled     500
confirmed    500

In [81]:
data.iloc[6]

Name           Jang
date     2017-01-09
price           600
state      canceled
Name: 6, dtype: object

In [83]:
data.pivot_table(index = 'state',values='price',
                aggfunc=lambda price: price.iloc[1])

           price
state
canceled     600
confirmed    700

## Groupby

In [86]:
data.groupby("state").head(1)
# state를 기준으로 dataframe을 두개 만듬. head(1)로 각 dataframe의 첫번째를 가져옴.

   Name        date  price      state
0  Kang  2017-01-01    500  confirmed
4   Lee  2017-01-07    500   canceled

In [87]:
data.groupby("state").head(data.shape[0])

   Name        date  price      state
0  Kang  2017-01-01    500  confirmed
1   Kim  2017-01-03    700  confirmed
2  Choi  2017-01-03    900  confirmed
3  Park  2017-01-05    800  confirmed
4   Lee  2017-01-07    500   canceled
5  Yoon  2017-01-09    700  confirmed
6  Jang  2017-01-09    600   canceled
7    Ko  2017-01-10    200   canceled

In [89]:
data.groupby("state")['price'].unique()
# mean, std 등 aggfunc 다됨

state
canceled          [500, 600, 200]
confirmed    [500, 700, 900, 800]
Name: price, dtype: object

In [90]:
data.groupby("state")['price'].value_counts()

state      price
canceled   200      1
           500      1
           600      1
confirmed  700      2
           500      1
           800      1
           900      1
Name: price, dtype: int64

In [94]:
data.groupby("state")['price'].value_counts().to_frame()

                 price
state     price
canceled  200        1
          500        1
          600        1
confirmed 700        2
          500        1
          800        1
          900        1

In [96]:
data.groupby(['date','state'])['price'].count()[lambda x : x > 1]

date        state
2017-01-03  confirmed    2
Name: price, dtype: int64

In [99]:
data.groupby(['date','state'])['price'].count().unstack()

state       canceled  confirmed
date
2017-01-01       NaN        1.0
2017-01-03       NaN        2.0
2017-01-05       NaN        1.0
2017-01-07       1.0        NaN
2017-01-09       1.0        1.0
2017-01-10       1.0        NaN

In [103]:
data.groupby(['date','state'])['price'].count().reset_index()

         date      state  price
0  2017-01-01  confirmed      1
1  2017-01-03  confirmed      2
2  2017-01-05  confirmed      1
3  2017-01-07   canceled      1
4  2017-01-09   canceled      1
5  2017-01-09  confirmed      1
6  2017-01-10   canceled      1

In [105]:
data.groupby(['date','state'])[['price','Name']].count()

                      price  Name
date       state
2017-01-01 confirmed      1     1
2017-01-03 confirmed      2     2
2017-01-05 confirmed      1     1
2017-01-07 canceled       1     1
2017-01-09 canceled       1     1
           confirmed      1     1
2017-01-10 canceled       1     1

In [106]:
data.groupby(['date','state'])[['price','Name']].count().apply(lambda x: x>1)

                      price   Name
date       state
2017-01-01 confirmed  False  False
2017-01-03 confirmed   True   True
2017-01-05 confirmed  False  False
2017-01-07 canceled   False  False
2017-01-09 canceled   False  False
           confirmed  False  False
2017-01-10 canceled   False  False

In [168]:
data.groupby(['date','state'])[['price','Name']].apply(lambda df: df)

   price  Name
0    500  Kang
1    700   Kim
2    900  Choi
3    800  Park
4    500   Lee
5    700  Yoon
6    600  Jang
7    200    Ko

In [165]:
# price에는 mean을 정리하고 name은 카운트 해보자 

a = data.groupby(['date','state'])[['price','Name']]\
.apply(lambda df: (df['price'].mean(),df['Name'].count()))

arr = a.tolist()
# tolist()는 series를 list로 바꿈

In [166]:
arr

[(500.0, 1),
 (800.0, 2),
 (800.0, 1),
 (500.0, 1),
 (600.0, 1),
 (700.0, 1),
 (200.0, 1)]

In [167]:
a

date        state
2017-01-01  confirmed    (500.0, 1)
2017-01-03  confirmed    (800.0, 2)
2017-01-05  confirmed    (800.0, 1)
2017-01-07  canceled     (500.0, 1)
2017-01-09  canceled     (600.0, 1)
            confirmed    (700.0, 1)
2017-01-10  canceled     (200.0, 1)
dtype: object

In [121]:
pd.DataFrame(a.tolist(),columns = ['price-mean','Name-count'])

   price-mean  Name-count
0       500.0           1
1       800.0           2
2       800.0           1
3       500.0           1
4       600.0           1
5       700.0           1
6       200.0           1

## 데이터 병합하기

### concantenate (concat)

In [125]:
# url = 'http://bit.ly/dsa-02-order-how'

how = pd.read_csv("order-how.csv")
print(how.shape)
how.head()

(8, 3)

   id payment_method installment
0   1          카드 결제         일시불
1   2          카드 결제         3개월
2   3         무통장 입금         NaN
3   4          카드 결제         일시불
4   5          카드 결제        12개월

In [131]:
order = data.copy()
print(order.shape)
order.head()

(8, 4)

   Name        date  price      state
0  Kang  2017-01-01    500  confirmed
1   Kim  2017-01-03    700  confirmed
2  Choi  2017-01-03    900  confirmed
3  Park  2017-01-05    800  confirmed
4   Lee  2017-01-07    500   canceled

In [132]:
pd.concat([order,how], axis=1)

   Name        date  price      state  id payment_method installment
0  Kang  2017-01-01    500  confirmed   1          카드 결제         일시불
1   Kim  2017-01-03    700  confirmed   2          카드 결제         3개월
2  Choi  2017-01-03    900  confirmed   3         무통장 입금         NaN
3  Park  2017-01-05    800  confirmed   4          카드 결제         일시불
4   Lee  2017-01-07    500   canceled   5          카드 결제        12개월
5  Yoon  2017-01-09    700  confirmed   8          카드 결제         4개월
6  Jang  2017-01-09    600   canceled   9         무통장 입금         NaN
7    Ko  2017-01-10    200   canceled  11         무통장 입금         NaN

### merge

In [133]:
order_201701 = pd.read_csv("order-201701.csv")
print(order_201701.shape)

(7, 7)

In [134]:
order_201702 = pd.read_csv("order-201702.csv")
print(order_201702.shape)

(4, 7)

In [139]:
order = pd.concat([order_201701,order_201702])
print(order.shape)
order.head()

(11, 7)

   id  user_id  product_id        date  price  address      state
0   1        3           9  2017-01-01    500    Seoul  confirmed
1   2        1           7  2017-01-03    700    Seoul  confirmed
2   3        3           8  2017-01-03    900  Daejeon  confirmed
3   4        4           2  2017-01-07    500      NaN   canceled
4   5        7           3  2017-01-09    700  Incheon  confirmed

In [135]:
product = pd.read_csv("product.csv")
user = pd.read_csv("user.csv")

In [137]:
print(user.shape)
user

(7, 5)

   id  name  gender  age                email
0   1  Kang    male   30       kang@gmail.com
1   2   Kim  female   22        kim@naver.com
2   3  Park    male   37  park@dsschool.co.kr
3   4   Lee  female   15      lee@empas.co.kr
4   5   Son    male   29     son@google.co.uk
5   6  Moon  female   40     moon@hanmail.com
6   7  Choi    male   34       choi@yahoo.com

In [141]:
order.merge(product, left_on='product_id', right_on='id', how='outer')

,id_x,user_id,product_id,date,price_x,address,state,id_y,title,price_y
0,1.0,3.0,9.0,2017-01-01,500.0,Seoul,confirmed,NaN,NaN,NaN
1,2.0,1.0,7.0,2017-01-03,700.0,Seoul,confirmed,7.0,pineapple,700.0
2,6.0,5.0,7.0,2017-01-09,600.0,Busan,canceled,7.0,pineapple,700.0
3,3.0,3.0,8.0,2017-01-03,900.0,Daejeon,confirmed,NaN,NaN,NaN
4,9.0,4.0,8.0,2017-02-12,200.0,Daejeon,canceled,NaN,NaN,NaN
5,4.0,4.0,2.0,2017-01-07,500.0,NaN,canceled,2.0,blueberry,500.0
6,10.0,8.0,2.0,2017-02-15,650.0,Daegu,confirmed,2.0,blueberry,500.0
7,5.0,7.0,3.0,2017-01-09,700.0,Incheon,confirmed,3.0,banana,700.0
8,8.0,1.0,3.0,2017-02-04,600.0,Seoul,confirmed,3.0,banana,700.0
9,7.0,2.0,5.0,2017-01-10,200.0,NaN,canceled,5.0,kiwi,200.0
10,11.0,2.0,6.0,2017-02-28,420.0,Busan,confirmed,6.0,melon,420.0
11,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1.0,apple,300.0
12,NaN,NaN,NaN,NaN,NaN,NaN,NaN,4.0,cereal,1000.0

In [148]:
%%time

# how = inner, outer, left, right
order.merge(product, left_on='product_id', right_on='id', how='left')

CPU times: user 2.99 ms, sys: 267 µs, total: 3.26 ms
Wall time: 3.09 ms

,id_x,user_id,product_id,date,price_x,address,state,id_y,title,price_y
0,1,3,9,2017-01-01,500,Seoul,confirmed,NaN,NaN,NaN
1,2,1,7,2017-01-03,700,Seoul,confirmed,7.0,pineapple,700.0
2,3,3,8,2017-01-03,900,Daejeon,confirmed,NaN,NaN,NaN
3,4,4,2,2017-01-07,500,NaN,canceled,2.0,blueberry,500.0
4,5,7,3,2017-01-09,700,Incheon,confirmed,3.0,banana,700.0
5,6,5,7,2017-01-09,600,Busan,canceled,7.0,pineapple,700.0
6,7,2,5,2017-01-10,200,NaN,canceled,5.0,kiwi,200.0
7,8,1,3,2017-02-04,600,Seoul,confirmed,3.0,banana,700.0
8,9,4,8,2017-02-12,200,Daejeon,canceled,NaN,NaN,NaN
9,10,8,2,2017-02-15,650,Daegu,confirmed,2.0,blueberry,500.0
10,11,2,6,2017-02-28,420,Busan,confirmed,6.0,melon,420.0

In [145]:
%%time
pd.merge(order, product, left_on='product_id', right_on='id', how='left')

CPU times: user 2.86 ms, sys: 132 µs, total: 3 ms
Wall time: 2.9 ms

,id_x,user_id,product_id,date,price_x,address,state,id_y,title,price_y
0,1,3,9,2017-01-01,500,Seoul,confirmed,NaN,NaN,NaN
1,2,1,7,2017-01-03,700,Seoul,confirmed,7.0,pineapple,700.0
2,3,3,8,2017-01-03,900,Daejeon,confirmed,NaN,NaN,NaN
3,4,4,2,2017-01-07,500,NaN,canceled,2.0,blueberry,500.0
4,5,7,3,2017-01-09,700,Incheon,confirmed,3.0,banana,700.0
5,6,5,7,2017-01-09,600,Busan,canceled,7.0,pineapple,700.0
6,7,2,5,2017-01-10,200,NaN,canceled,5.0,kiwi,200.0
7,8,1,3,2017-02-04,600,Seoul,confirmed,3.0,banana,700.0
8,9,4,8,2017-02-12,200,Daejeon,canceled,NaN,NaN,NaN
9,10,8,2,2017-02-15,650,Daegu,confirmed,2.0,blueberry,500.0
10,11,2,6,2017-02-28,420,Busan,confirmed,6.0,melon,420.0

In [150]:
order.merge(product, left_on='product_id', right_on='id', how='right')\
.merge(user, left_on='user_id', right_on='id', how='left')[lambda x: x['age']<30]

,id_x,user_id,product_id,date,price_x,address,state,id_y,title,price_y,id,name,gender,age,email
1,6.0,5.0,7.0,2017-01-09,600.0,Busan,canceled,7,pineapple,700,5.0,Son,male,29.0,son@google.co.uk
2,4.0,4.0,2.0,2017-01-07,500.0,NaN,canceled,2,blueberry,500,4.0,Lee,female,15.0,lee@empas.co.kr
6,7.0,2.0,5.0,2017-01-10,200.0,NaN,canceled,5,kiwi,200,2.0,Kim,female,22.0,kim@naver.com
7,11.0,2.0,6.0,2017-02-28,420.0,Busan,confirmed,6,melon,420,2.0,Kim,female,22.0,kim@naver.com

## Nan

In [151]:
# NaN = Not a Number = Null = NA != "NaN"
import numpy as np
np.nan

nan

In [152]:
type(np.nan)

float

In [153]:
np.nan+1

nan

In [155]:
# NaN 이랑 None은 다름. None은 그냥 "없음" 
None
type(None)

NoneType

In [157]:
# 무한대와 무한대는 같이 않음. 
# np.nan은 무슨 연산을 하든 false & nan이 나옴. 예외는 is. 
np.nan == np.nan

False

In [158]:
np.nan is np.nan

True

In [159]:
pd.isnull(np.nan)

True

In [160]:
pd.isnull(None)

True

In [161]:
order['address'].isnull()

0    False
1    False
2    False
3     True
4    False
5    False
6     True
0    False
1    False
2    False
3    False
Name: address, dtype: bool

In [162]:
order['address(clean)'] = order['address'].fillna('Seoul')
order[order['address(clean)'].isnull() ]

Empty DataFrame
Columns: [id, user_id, product_id, date, price, address, state, address(clean)]
Index: []